import { useState } from "react";
import { Breadcrumb, Carousel, Container, Table } from "react-bootstrap";

import "../css/trot.css";
import trot1 from "../images/trot.jpg";
import trot2 from "../images/trot1.jpg";
import MusicList from "../musicList.json";

function Trot() {

    let [musicList, setMusicList] = useState(MusicList);
    let tablelist = musicList.filter(item => item.genre == 'trot').map((i)=>{
        return (
            <tr>
                <td><img src={i.image} alt={i.id}></img></td>
                <td><h3>{i.song}</h3><br></br><p>{i.singer}</p></td>
                <td><h3>{i.title}</h3><p>{i.content}</p></td>
            </tr>
        )
    });

    console.log(tablelist);

  return (
    <>
      <div className="subContent artist-detail-content">
        <div className="artistDetail subDetail m-4">
            <div className="artistTop subTop mt-3">
                <div className="left">
                    <img src={trot1} alt="사진"></img>
                </div>
                <div className="right">
                    <div className="subTit">
                        <span>한국민족문화대백과사전</span>
                        <div className="titTxt">
                            <h4>트로트</h4>
                        </div>
                        <div className="txtBox">
                            <div className="profile">
                                <h3>정의</h3>
                                <p>일제강점기에 일본 엥카의 영향을 받아 형성된 대중가요</p>
                            </div>
                            <div className="profile">
                                <h3>개설1</h3>
                                <p>독특한 5음계를 음악적 특징으로 하며, 일본 엥카의 번역·번안 노래를 거쳐1930년을 전후한 시기에 국내 창작이 본격화됨</p>
                            </div>
                            <div className="profile">
                                <h3>개설2</h3>
                                <p>1930년대 중반에 정착된 대중가요 양식으로, 신민요와 더불어 일제강점기 대중가요의 양대 산맥을 이루고 있음</p>
                            </div>
                            <div className="profile">
                                <h3>개설3</h3>
                                <p> 1960년대 이후 스탠더드팝이나 포크 등이 강세를 보이는 시기에 쇠락하지만, 새로운 양식들과의 혼융을 통해 계속 생명력을 유지하였음</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <hr></hr>
            <div className="artistMember">
                <h4 className="subTit1">
                    " 특징 "
                </h4>
                <ul className="artistMemberBox">
                    <img src={trot2} alt="img"></img>
                </ul>
                <ul className="my-5 mx-5 px-5 pt-5">
                    <p>
                    초기 트로트의 음계는 장음계에서 4음과 7음을 뺀 오음 장음계(도레미솔라)와 일제강점기를 거치며 들어온 단음계에서 4음과 7음을 뺀 미야코부시 음계(라시도미파)가 쓰였었다.<br></br>
                    박자는 듀플미터(Duple metre, 2박 계열 박자)를 자주 사용했다.
                    노래 밑에 쿵짝쿵짝 소리가 뚜렷하게 들리기 때문에 ‘쿵짝’, ‘뽕짝’이란 이름으로도 불리게 되었다.<br></br>
                    여기서 4박 계열로 변경한 것이 위 사진의 3번째 박자 패턴인데 송대관의 유명한 히트곡 네박자의 가사 '쿵짝 쿵짝 쿵짜자 쿵짝'은 그 박자를 그대로 구음화 한 것이다.<br></br>
                    일명 뽕끼, 뽕기, 뽕필 등으로 표현하는 독특한 느낌이 있어서 전주만 듣고도 트로트 특유의 느낌을 느낄 수 있다.<br></br>
                    초기 트로트보다 훨씬 발전한 현대 트로트는 5음계뿐 아니라 7음계와 발라드, 락, 댄스 등 다양한 장르의 요소들을 접목하여 만든다.</p>
                    <br></br>
                    <p>사랑과 이별, 고향을 그리워하는 한과 애수가 담긴 내용이더라도 대체로 노래 분위기는 아주 신나며 지역별 특징이 잘 드러나는 가사, 사투리 억양을 연상시키는 음정, 국악에서 많이 사용하는 목소리를 길게 떠는 창법 등 한국적인 요소와 허스키 보이스를 이용하여 향토적이고 구수한 느낌을 주고 추임새, 감탄사가 많고 음의 높낮이 변화가 적으며 길이 변화가 크다.</p>
                    <p>
                    트로트 가사에서는 영어를 잘 쓰지 않는데 영어를 사용하면 특유의 라임과 리듬을 해칠 수도 있기 때문인 듯하다. <br></br>
                    요즘 나오는 최신 가요들처럼 영어를 포함하는 사례가 없지는 않지만 드문 편이다.<br></br> 
                    현철의 "I Love You", 김명성의 "신비한 사랑", 홍진영의 '오늘밤에' 등을 영어가사 포함 사례로 꼽을 수 있지만 이마저도 한두 마디 간단한 표현 정도다.
                    </p>
                    <p>
                    트로트에 랩이 들어가는 경우는 거의 없다. <br></br>
                    랩이 들어가면 마초적이고 험악한 느낌이 될 수 있으므로 노인들의 정서에 맞지 않기 때문이다.
                    </p>
                    <p>
                    제목 또한 한국어로 되어 있다. <br></br>'그다음은나도몰라요', '사랑은돈보다좋다' 등 띄어쓰기가 없는 10글자 내외로 된 짧은 문장 형태인 경우가 그러하다.
                    </p>
                    <p>
                    트로트는 아이돌 음악과는 완전히 반대된다고 할 수 있지만 아이돌이 트로트 음악을 선보이는 경우도 있다.<br></br> 
                    티아라와 오렌지캬라멜은 대부분의 노래에 트로트적인 느낌이 어느 정도 있으며, 크레용팝과 슈퍼주니어도 트로트 곡(각각 어이, 로꾸거)을 발매한 적이 있다.
                    </p>
                </ul>
            </div>
            <div className="activities">
                <h4 className="subTit1">" 추천 음악 "</h4>
                <Table striped bordered hover>
                <thead>
                    <tr>
                        <th>앨범</th>
                        <th>음악/아티스트</th>
                        <th>설명</th>
                        <th>찜하기</th>
                    </tr>
                </thead>
                <tbody>
                    {tablelist}
                </tbody>
                </Table>
            </div>
            <div className="activities">
                <h4 className="subTit1">" 역사 "</h4>
                <div className="activities-wrapper">
                    <dl>
                        <dt>
                            1950년대 이전
                        </dt>
                        <dd>
                        서양에서 전기 녹음기술이 개발되고 음반회사 제작 체제가 확립되며 당시 유행하던 서양 대중가요들이 1920년대 동아시아에서 가장 빠르게 서양문물을 받아들이던 일본으로 전해지고 그러한 영향으로 일본 내에서의 서양식 대중가요가 형성되기 시작했다. 그 이후 약간 늦은 1920년대 말~1930년대 초 부터 일제강점기를 겪고 있던 조선에서도 비슷한 현상이 나타나기 시작했는데 이 시기의 노래들은 '트로트'도 '엔카'도 아니었으며 단지 그 시절 유행하던 외국 가요와 현지 지역색이 융합한 유행가, 가요였다.
                        </dd>
                        <dd>
                        1930~1940년대 즈음엔 백년설, 고복수, 이난영, 남인수, 이애리수 등을 중심으로 여러 명곡들이 유행하고 있었다.당시엔 트로트를 흔히 '유행가'라고 불렀는데 현대 한국인들이 K-POP을 '가요'라고 부르는 맥락과 비슷하다. 몇몇 현대 음악 평론가들은 트로트를 '전통가요'라고 부르기도 한다. 이 당시 노래들은 서양에서 전해진 세련된 음악이라는 인식이 있었다. 당시 트로트 가수들은 대부분 당대의 미성이었고 가사 또한 심미적으로 풍부하며 서정적인 분위기를 띄었다. 특히 목포의 눈물, 나그네 설움 등은 지금까지도 명곡이라고 꼽히는 곡들이다. 시대적 상황상 일본 대중가요 노래들이 들어오기도 하고 한국적인 감성으로 이루어진 노래 또한 꾸준히 발표하며 외국어 가사인 곡을 한국어로 번안, 개사하여 부르거나 한국계 가수가 일본으로 건너가 활동하기도 하는 등 여러 교류와 발전을 진행하고 있었다.
                        </dd>
                        <dd>
                        그러나 한편으론 일제강점기가 진행될수록 광복 이후와는 비교할 수 없을 정도로 왜색이 짙은 곡들 또한 많아지기도 했다. 왜냐하면 당시 조선의 고등 교육 시스템은 일본 정부가 의도한 대로 굉장히 열악했기 때문에 많은 지식인들과 음악가들은 가까운 일본으로 유학을 가 공부를 하면서 자연스럽게 일본의 영향을 받게 만들었기 때문이다. 물론 서양 유학파 출신들도 있었지만 거리상 비교적 적은 수였다. 게다가 일제강점기 말기로 갈수록 일본의 프로파간다 영향이 더해져 친일 가수들이 활동한 영향도 있는 데다가 일제가 아예 민족말살 통치를 시작함으로서 한국적인 정서를 띄는 노래를 만들기가 힘들어졌다. 목포의 눈물 같은 '민족의 노래'로 유명한 이난영 조차 일부 친일 행적 의혹을 받고 있으니, 이런 시대에서 왜색을 띈 노래가 궤도에 오른 건 순수히 피식민지 백성들의 힘만으로는 막을 수 없었을 것이다. 해방 이후 일본과의 문화적 단절이 시작되고 트로트의 기반이 된 그 당시 가요는 왜색을 조금 걷어내기 시작함과 동시에 여전히 한국 가요계에서 주류로 자리잡을 수 있었는데 이를 보여주는 일화가 하나 있다. 이화여전(현재 이화여대) 학생들이 민요를 재구성하여 창작곡을 만들자 '어떻게 감히 이화여전이란 곳에서 트로트같은 음악이 아닌 민요 따위를 가지고 음악을 만들 수 있느냐?'란 여론이 나온 적이 있었다고 한다. (출처 《흥남부두의 금순이는 어디로 갔을까》). 당시엔 트로트를 세련된 느낌의 서구적인 음악으로 인식하고 있었다는 뜻이다.
                        </dd>
                        <dd>
                        한편 동시기에 한국의 전통적인 민요를 계승했던 '신민요'라는 새로운 음악장르가 등장하면서 1950년대까지 트로트와 주요 음악장르라는 위치를 놓고서 경쟁했으나 1960년대 이후 팝송의 영향으로 스탠더드 팝에게 밀려났다.
                        </dd>
                        <dt>
                        1950년~1960년대
                        </dt>
                        <dd>
                        한국전쟁 이후 당시 유행하던 대중가요들은 '트로트'라는 이름으로 불리며 장르적 정체성을 형성하며 점점 대중화의 길을 걷기 시작했다. 비슷하게 일본에서도 60년대 전후로 '엔카'라는 명칭과 장르적 정체성을 형성했다. 박재홍의 울고 넘는 박달재, 현인의 신라의 달밤 등 대중들 사이에서 매우 크게 유행했던 트로트가 나온 것도 이 때 즈음. 이 당시도 트로트는 여전히 주류 문화였으며 1970년대 포크송이 등장하기 전까지 당대 대부분의 명곡을 트로트가 차지했다. 특히 한국전쟁을 소재로 한 이별의 부산정거장이나 굳세어라 금순아 등의 트로트 명곡이 등장하여 크게 유행하기도 했다. 특히 1950~1960년대는 이전 반 백년 동안과는 확연히 다른 대한민국의 변화를 겪은 시기인데 이런 부분을 다룬 트로트 또한 많이 등장하였다. 예를 들어 박재홍의 유정천리는 영화 유정천리의 주제곡으로 만들어 큰 인기를 얻은 노래인데 3.15 부정선거를 풍자하는 내용으로 대구에서 개사하여 부르며 또 다시 큰 인기를 얻기도 했다. 사랑과 관련된 내용의 트로트가 본격적으로 등장한 것도 바로 이 시기. 대표적으로 60년대 중후반 전성기 활동을 한 배호의 히트곡 돌아가는 삼각지가 있다.
                        </dd>
                        <dd>일부에서는 일제강점기의 왜색이 다소 남아있어 정부와 시민단체들로부터 '왜색가요'라며 비판을 받던 기간이기도 했다. 하지만 독립으로 시작된 일본과의 문화적 단절은 트로트를 왜색가요가 아닌 한국만의 독자적인 특징들로 확립하여 '트로트'라는 하나의 장르로서 발전시키게 된 중요한 계기가 되었다. 이 때 즈음 시기부터 본격적으로 한국 트로트와 일본 엔카는 각자 다른 정체성과 특징을 확립하며 나아가기 시작한다.</dd>
                        <dd>1950년대는 트로트가 본격적으로 대중화 되었다는 점에서 큰 의미가 있는 시기이다. 누군가는 이를 트로트가 서민의 노래가 되고 향유층이 넓어졌으며 양적으로 늘어남과 동시에 다양한 소재를 다루게 되었다는 점에서 긍정적으로 바라보는 반면 누군가는 이러한 대중화가 상업성을 동반한 양산과 함께 질을 떨어트리게 만들었다며 부정적으로 바라보기도 한다. 하지만 분명 많은 사람들이 즐기게 되었다는 것은 큰 의미가 있다. 일제강점기를 거친 것 때문에 왜색이 묻었다고 민족주의자들에게 비판을 받던 트로트가 한국민들에게 받아들여질 정도로 왜색을 떨쳐내어 대중화 하지 않고 끝까지 그 색을 고집했다면 인기에 나쁜 영향이 있었을 것리다.</dd>
                        <dd>해방 이후 대대적으로 왜색을 걷어내는 운동을 통해 트로트 역시 왜색을 지우고 한국적인 정서를 띄게 되었으므로 일부 악의적인 주장처럼 트로트가 일본 엔카의 열화판이 아닌 한국 음악의 한 장르로서 남아있을 수 있게 된 것이다. 대중화가 이에 기여하지 않았다고 보기는 어렵다.</dd>
                        <dd>
                        또 엔카는 원래 일본에서 활동하던 특정 정치세력들이 자신들의 주장을 표출하기 위해 써먹던 정치 선전용 음악이었다. 그래서 '연설하듯이 노래한다'는 뜻으로 연가(演歌, 엔카)라는 표현이 생긴 것이다. 이후 점차 음악적인 면에서 한국 민요와 트로트의 영향을 받기도 하여 정치색은 줄어들었다.
                        </dd>
                        <dd>1950년대에는 신민요가 트로트의 주요한 경쟁자였지만 동시에 주한 미8군의 영향을 받아서 소위 재즈 풍이라는 스탠더드 팝이 등장하면서 뽕짝 풍이라고 불리는 트로트와 경쟁했다. 그러나 이 두 장르는 1970년대로 들어서면서 침체기를 겪었다. 스탠더드 팝의 경우에는 몰락한 뒤 다시 부활하지 못 했지만 1970년대 중반 이후 트로트는 다시 부활하는데 성공해서 지금으로 이르게 되었다.</dd>
                        <dt>1970년~1990년대</dt>
                        <dd>1970년대부터 포크 음악 등 새로운 장르가 들어오고 한국 가요계에서 다양한 장르가 여럿 대중화한 1980년대를 지나며 트로트는 비주류로 밀려나기 시작했다. 특히 1990년대는 트로트가 급격히 쇠퇴하고 암흑기를 맞이한 시기로 여기기도 하는데 유재하를 기점으로 발라드들이 대거 등장하며 소위 '뽕끼' 없는 발라드 시대가 열렸기 때문. 이후 김현철, 신승훈 등을 거치며 더군다나 1992년 서태지와 아이들부터 댄스 힙합그룹이 대거 등장하면서 가요계 판도가 10대~20대 위주로 재편하며 이전까지는 가요순위 1위를 독식하기도 했던 트로트는 점점 설 자리를 잃게 되었다. 한편으론 이는 1980년대 후반 주현미, 설운도, 태진아, 송대관, 현철 등 덕분에 트로트 전성시대였기 때문이기도 하다.</dd>
                        <dd>하지만 이렇게 19~20세기에 유행했던 음악들이 21세기 현대 음악들에게 밀려나는 사례는 전 세계에서 보이는 현상이기 때문에 단순히 자연스러운 시대적 흐름일지도 모른다.</dd>
                        <dd>구체적으로 살펴본다면 1970년대는 포크 음악과 록 음악이 유행했다. 통기타를 들고 청바지를 입은 젊은이라는 이미지가 형성되었던 시기이기도 하다. 그러나 1970년대 중반 가요 대정화와 대마초 파동으로 인해서 새로운 장르들이 직격탄을 맞았고 트로트가 그 틈을 타고 다시 부활하는데 성공했다. 1980년대에는 록 음악이 트로트에서 탈피하면서 서구적인 발라드가 도입되었지만 트로트의 인기는 여전했으며, 당시에는 트로트가 아니라고 보았지만 트로트적인 뽕끼가 들어간 발라드도 상당히 유행했고 또 소방차, 박남정, 박혜성등의 댄스가수도 트로트 창법과 트로트 멜로디를 차용한 댄스음악을 하여 오늘날의 댄스트로트의 조상이 되었다.</dd>
                        <dd>1990년대 초반부터는 K-POP의 직계 조상인 서태지와 아이들이 보여주듯이 힙합과 R&B같은 새로운 흑인음악 장르들이 직수입되기 시작했고 대중가요는 댄스, 발라드가 언더그라운드에서는 힙합 등의 흑인음악, 록 음악 위주의 인디음악이 새로운 주류가 되기 시작했다.</dd>
                        <dt>2000~2018년</dt>
                        <dd>서태지와 아이들 데뷔 이후 1993년 가수 김수희의 '애모'가 가요톱텐에서 골든컵을 받은 것이 거의 마지막 가요 차트 1위가 될 뻔했고, 애모 이후 현재까지 대중가요 차트 순위에서 1위를 차지한 기록은 2005년 1월 MBC 음악캠프에서 통산 2주 1위를 한 장윤정의 《어머나》, 2007년 9월 뮤직뱅크에서 1위를 한 강진의 《땡벌》 두 곡뿐이며 1위 후보까지 오른 기록은 2009년 2월 뮤직뱅크에서 BIGBANG 대성의 《대박이야!》와 2014년 11월 MBC MUSIC 쇼챔피언 TOP 10으로 오른 홍진영의 《산다는 건》이다. 이렇게 인기가 떨어진 탓에 젊은 트로트 가수의 유입이 끊겨버렸고, 기존에 있던 중년 트로트 가수들만이 남아서 트로트의 명맥을 이어가는 상황이 벌어졌다. 그리하여 트로트는 중장년층이 즐기는 음악이라는 인식이 자리잡았다.</dd>
                        <dd>그래도 2004년 말 등장한 장윤정의 《어머나》가 대히트하며 박상철, 박현빈, LPG, 홍진영 등 젊은 트로트 가수들이 유입되면서 전성기만큼은 아니지만 어느 정도 숨이 트였다. 기존 K-POP 가수들 또한 트로트 음반을 발매하는 일도 생기고 예능 프로에서 효과음으로 삽입하기도 하며 TV 시장과 대중가요 프로에서 밀려났을 뿐이지 행사무대나 가요무대같은 트로트 가요 프로그램에서는 여전히 상당한 인기를 누리고 있다.</dd>
                        <dd>하지만 이 시기 1920년대부터 1990년대까지 무수히 많은 경쟁자를 이겨가면서 누린 인기에 비하면 초라한 모습을 보였다는 점은 부정할 수가 없다. 다양한 이유가 있겠지만 1950년대부터 1990년대까지의 트로트는 경쟁자들과 교류하면서 시대의 흐름에 뒤쳐지지 않기 위해서 노력했지만 케이팝과 발라드, 한국힙합, 인디음악이 정착되어가는 이 시기에는 무력한 모습을 보이면서 과거 첫 경쟁자였던 신민요가 몰락해가던 모습을 그대로 보이고 있었다는 점을 들 수 있다.</dd>
                        <dd>물론 세미트롯이란 장르나 아모르파티와 같은 신선한 시도도 존재했지만 트로트 음악의 소비자들이 그런 시도에 대해서 미적지근한 반응을 보이면서 보수적으로 반응한 것은 부정할 수가 없어보인다.</dd>
                        <dt>2019~2020년</dt>
                        <dd>
                        2019년 TV 조선에서 방영한 〈내일은 미스트롯〉과 MBC에서 방영한 〈놀면 뭐하니?〉에서 뽕포유 프로젝트의 성공으로 트로트 열풍의 시작을 알렸고, 2020년 연초부터 방영된 〈내일은 미스터트롯〉은 중장년층을 꽉 잡은 덕분에 시청률 35%를 넘기는 기염을 토했다. 중장년층에게만 인기 있었을 거라는 고정관념과 달리 대한민국 모든 수험생들의 수학 구세주 덕분에 그의 강의를 듣거나 들었던 102030 젊은 층에게도 큰 화제가 되었다. 미스/미스터트롯 네이버 채널의 영상 댓글 분포도를 보면 죄다 5060 일색인 영상들 속에 유일하게 정승제의 영상만 1020이 절반 이상이고 60대 이상이 0%를 기록할 지경으로 정승제만큼은 청년층에서도 큰 인기를 끌었다.
                        </dd>
                        <dd>다시 트로트가 인기를 끌면서 원로 트로트 가수들 역시 다시 주목을 받게 되었고, 왕년의 인기 트로트 가수였던 김연자, 주현미, 진성 등이 대표적인 수혜자가 되었으며 특히 주현미는 트로트 외의 장르로 넓히는 시도까지 할 정도로 인지도가 높아졌다. 코로나19 유행으로 행사가 취소된 현 시국에 특히 TV 출연이 잦아지고 있는데, 이렇게 노출 빈도가 늘면서 트로트 가수들은 시청률 보증수표로 자리잡았고, 트로트 관련 프로그램의 편성도 늘어났다. 반면 이로 인해 아이돌 시장은 끝이 보이지 않는 암흑기에 접어들었다.</dd>
                        <dd>다만, 미스터트롯 열풍이 모든 연령층의 인기나 트로트 자체의 부흥이라기보다는 고연령층에 편중된 인기와 특정 참가자들의 인기에 치우쳤다는 것이 상당히 우려되는 점이다.</dd>
                    </dl>
                </div>
            </div>
        </div>
      </div>
    </>
  );
}

export default Trot;
